Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus was built from the ground up for Kubernetes making it easy to deploy applications without having to understand all of the complexities of the platform. Quarkus allows developers to automatically generate Kubernetes resources including building and deploying container images without having to manually create YAML files.
ja_jp: Quarkus は Kubernetes のためにゼロから構築されており、プラットフォームの複雑さをすべて理解することなく、アプリケーションを簡単にデプロイできます。Quarkus を使用すると、開発者は YAML ファイルを手動で作成することなく、コンテナーイメージの構築とデプロイを含む Kubernetes リソースを自動的に生成できます。

source: Quarkus was chosen over alternatives such as Spring Boot, Micronaut and Helidon. While Spring is the predominant Java framework within Abraxas, the Polaris team chose Quarkus for a number of reasons including its superior performance in a Kubernetes environment.
ja_jp: Quarkusは、Spring Boot、Micronaut、Helidonなどの候補の中から選ばれました。AbraxasではSpringが主流のJavaフレームワークですが、Polarisチームは、Kubernetes環境での優れたパフォーマンスなど、多くの理由からQuarkusを選択しました。

source: Quarkus was designed from the ground up with a container-first philosophy. Unlike traditional frameworks that were retrofitted for containers, Quarkus optimizes applications specifically for containerized environments by shifting heavy computational work, such as classpath scanning, configuration loading, and dependency injection, from runtime to build time.
ja_jp: Quarkus は、コンテナーファーストの理念に基づいて最初から設計されました。コンテナー向けに後付けで修正された従来のフレームワークとは異なり、Quarkus は、クラスパスのスキャン、設定のロード、依存性注入などの重い計算処理を実行時からビルド時に移行させることで、コンテナー化された環境向けにアプリケーションを特別に最適化します。

source: Quarkus was upgraded to https://smallrye.io/smallrye-mutiny/2.0.0/reference/migrating-to-mutiny-2/[Mutiny 2] and now uses the Java Flow API instead of Reactive Streams.
ja_jp: Quarkusは link:https://smallrye.io/smallrye-mutiny/2.0.0/reference/migrating-to-mutiny-2/[Mutiny 2] にアップグレードされ、Reactive Streamsの代わりにJava Flow APIを使用するようになりました。

source: Quarkus watches the files and Quinoa triggers a new Web UI build on changes (you can configure different builds for dev and prod).
ja_jp: Quarkusがファイルを監視し、Quinoaは変更時に新しいWeb UIビルドをトリガー（devとprodで異なるビルドを構成することができます）。

source: Quarkus website got a refresh and we enabled GitHub discussions for community conversations.
ja_jp: Quarkusのウェブサイトがリニューアルされ、コミュニティでの会話のためにGitHub discussions が有効化されました。

source: Quarkus why, how and what by Emmanuel Bernard
ja_jp: Quarkus のなぜ、何を、どうやって by Emmanuel Bernard

source: Quarkus will apply the manifests in the order they are specified in the list.
ja_jp: Quarkus は、リストで指定された順序でマニフェストを適用します。

source: Quarkus will automatically find all the classes annotated with `@XmlRootElement` and then bound them to the JAXB context.
ja_jp: Quarkus は、 `@XmlRootElement` でアノテーションが付けられたすべてのクラスを自動的に検出し、それらを JAXB コンテキストにバインドします。

source: Quarkus will automatically register all the classes annotated with `@BsonDiscriminator` with the POJO codec.
ja_jp: Quarkusは、 `@BsonDiscriminator` でアノテーションされたすべてのクラスをPOJO codecで自動的に登録します。

source: Quarkus will await resources such as deployments to be ready before moving on to the next manifest. All applied resources are guaranteed to be ready by the time your application finishes startup.
ja_jp: Quarkus は、次のマニフェストに進む前に、デプロイメントなどのリソースが準備完了になるのを待ちます。すべての適用されたリソースは、アプリケーションが起動を完了するまでに準備が整っていることが保証されます。

source: Quarkus will only augment the `SecurityIdentity` created with the `@TestSecurity` annotation if you set the `@TestSecurity#augmentors` annotation attribute to the `CustomSecurityIdentityAugmentor.class` like this:
ja_jp: Quarkus は、 `@TestSecurity`アノテーションで作成された`SecurityIdentity` を、次のように設定した場合にのみ拡張します。 `@TestSecurity#augmentors` アノテーション属性を `CustomSecurityIdentityAugmentor.class` に次のように追加します。

source: Quarkus will set many Hibernate Reactive configuration settings automatically, and will often use more modern defaults.
ja_jp: Quarkus は多くの Hibernate Reactive の設定を自動的に行い、多くの場合、より現代的なデフォルトを使用します。

source: Quarkus will set this parameter to the current request URL by default. For example, if the user is trying to access a Quarkus service endpoint at `http://localhost:8080/service/1` then the `redirect_uri` parameter will be set to `http://localhost:8080/service/1`. Similarly, if the request URL is `http://localhost:8080/service/2` then the `redirect_uri` parameter will be set to `http://localhost:8080/service/2`, etc.
ja_jp: Quarkus は、デフォルトでこのパラメーターを現在のリクエスト URL に設定します。たとえば、ユーザーが `http://localhost:8080/service/1` で Quarkus サービスエンドポイントにアクセスしようとしている場合、 `redirect_uri` パラメーターは `http://localhost:8080/service/1` に設定されます。同様に、リクエスト URL が `http://localhost:8080/service/2` の場合、 `redirect_uri` パラメーターは `http://localhost:8080/service/2` などに設定されます。

source: Quarkus will share the Infinispan broker if you have multiple applications running in dev mode. Dev Services for Infinispan implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single broker.
ja_jp: 開発モードで複数のアプリケーションを実行している場合、QuarkusはInfinispanブローカーを共有します。 Infinispanの開発サービスは、 _dev_ モードで実行されている複数のQuarkusアプリケーションが1つのブローカーを共有するための _service discovery_ メカニズムを実装しています。

source: Quarkus will start in development mode as normal, but down the bottom of the screen you should see the following:
ja_jp: Quarkusは通常通り開発モードで起動しますが、画面の下部に以下のような表示があります。

source: Quarkus will substitute `${database-name}` with the value obtained from the entry with name `database-name` of the `postgres` Secret. `somehost` is the name of the Kubernetes `Service` that was created when PostgreSQL was deployed to Kubernetes.
ja_jp: Quarkusは、 `${database-name}` を `postgres` Secret の `database-name` という名前のエントリから取得した値で置き換えます。 `somehost` は、PostgreSQL を Kubernetes にデプロイした際に作成された Kubernetes の `Service` の名前です。

source: Quarkus will substitute `${database-password}` with the value obtained from the entry with name `database-password` of the `postgres` Secret.
ja_jp: Quarkusは、 `${database-password}` を `postgres` Secret の `database-password` という名前のエントリから得た値で置き換えます。

source: Quarkus will substitute `${database-user}` with the value obtained from the entry with name `database-user` of the `postgres` Secret.
ja_jp: Quarkusは、 `${database-user}` を `postgres` Secret の `database-user` という名前のエントリから得た値で置き換えます。

source: Quarkus wouldn't be as successful if it weren't for its extension ecosystem. In the beginning, we were adding all extensions to the core Quarkus repository, but eventually it became too much of an overhead or just not always sensible to include an extension into the core. Some have since then created their own repositories external to Quarkus, but others just never happened because not everyone wants the overhead of maintaining a build setup while in other cases we actually had an idea for an extension but not solidified enough yet to be included in core (and consequently failed to find other community members interested and eager to help).
ja_jp: エクステンションのエコシステムがなければ、Quarkus はこれほどの成功を収められなかったでしょう。当初は、すべてのエクステンションを Quarkus のコアリポジトリーに追加していました。しかし、最終的にはオーバーヘッドが大きすぎたり、エクステンションをコアに含めることが必ずしも賢明とは限らなくなってしまいました。それ以来、Quarkus の外部に独自のリポジトリーを作成した人もいますが、誰もがビルドセットアップを維持するためのオーバーヘッドを望んでいるわけではないので、それが実現しなかった人もいます。

source: Quarkus' "developer joy" mantra obviously applies to your time spent in the IDE and that's what the Red Hat Developer team is vying for. As we reflect on the past five months of releases, we're pretty excited about the progress we've made on the Quarkus development experience, in IntelliJ IDEA.
ja_jp: Quarkusの「開発者の喜び」というマントラは、IDEで過ごす時間にも明らかに当てはまります。過去5ヶ月間のリリースを振り返ると、IntelliJ IDEAでのQuarkus開発エクスペリエンスの進歩にとても興奮しています。

source: Quarkus' core principles offer a versatile foundation that empowers developers to build virtually any type of modern application, from traditional monoliths to cloud-native, serverless architectures. Its flexibility makes it ideal for applications of all sizes and complexities, enabling organizations to adapt to evolving business needs and technological landscapes. One of the standout features of Quarkus is its reactive core. This allows applications to handle today’s most demanding challenges with remarkable efficiency. By optimizing resource usage, Quarkus ensures that applications can scale seamlessly, even under high loads, while minimizing infrastructure costs. The framework supports both imperative and reactive programming models, giving developers the freedom to choose the right approach based on the specific requirements of their project. This flexibility enables the creation of high-performance applications that can react to real-time events and handle asynchronous workflows with ease.
ja_jp: Quarkus のコア原則は、従来のモノリスからクラウドネイティブのサーバーレス アーキテクチャーまで、事実上あらゆるタイプの最新アプリケーションを開発者が構築できるようにする多用途の基盤を提供します。その柔軟性により、あらゆる規模と複雑さのアプリケーションに最適であり、組織は進化するビジネス ニーズとテクノロジー ランドスケープに適応できます。Quarkus の際立った機能の 1 つは、リアクティブ コアです。これにより、アプリケーションは今日の最も要求の厳しい課題を驚くほど効率的に処理できます。Quarkus は、リソースの使用を最適化することで、インフラストラクチャー コストを最小限に抑えながら、高負荷下でもアプリケーションをシームレスに拡張できるようにします。フレームワークは命令型プログラミング モデルとリアクティブ プログラミング モデルの両方をサポートしているため、開発者はプロジェクトの特定の要件に基づいて適切なアプローチを自由に選択できます。この柔軟性により、リアルタイム イベントに反応し、非同期ワークフローを簡単に処理できる高性能アプリケーションを作成できます。

source: Quarkus' philosophy is to prevent as much as possible slow and memory intensive dynamic code execution by shifting left these actions and eventually do them during the build time. A Quarkus extension is a Java piece of code acting as an adapter layer for your favorite library or technology.
ja_jp: Quarkus の概念は、これらのアクションの左シフトを行い、最終的にはビルド時に実行することで、可能な限り低速でメモリー集約的な動的コードの実行を防ぐことです。Quarkus のエクステンションは、お気に入りのライブラリやテクノロジーのアダプターレイヤーとして機能する Java のコードです。

source: Quarkus's build-time philosophy means extensions can tidy up API boilerplate and make programming models more concise and expressive. A good starting point is usually to use xref:writing-extensions.adoc#scanning-deployments-using-jandex[Jandex] to scan user code for annotations and other markers. Although providing new, joyful, ways to do things is good, it's important to not break the normal patterns that users may be familiar with.
ja_jp: Quarkus のビルド時の思想により、エクステンションは API のボイラープレートを整理し、プログラミングモデルをより簡潔で表現力豊かなものにできます。通常は、xref:writing-extensions.adoc#scanning-deployments-using-jandex[Jandex] を使用してユーザーコードのアノテーションやその他のマーカーをスキャンするのが良い出発点となります。新しく使い勝手の良い方法を提供することは素晴らしいことですが、ユーザーが慣れ親しんでいる通常のパターンを壊さないようにすることも重要です。

source: Quarkus's integration with lambdas also supports Quarkus's Live Coding development cycle. You an bring up your Quarkus lambda project in dev or test mode and code on your project live.
ja_jp: Quarkus と Lambda の統合は、Quarkus のライブコーディング開発サイクルもサポートします。Quarkus Lambda プロジェクトを開発モードまたはテストモードで起動し、プロジェクトのコードをライブで作成します。

source: Quarkus's integration with lambdas also supports Quarkus's Live Coding development cycle. You can bring up your Quarkus lambda project in dev or test mode and code on your project live.
ja_jp: Quarkus と Lambda の統合は、Quarkus のライブコーディング開発サイクルもサポートします。Quarkus Lambda プロジェクトを開発モードまたはテストモードで起動し、プロジェクトのコードをライブで作成します。

source: Quarkus's reactive core is a key contributor to its excellent throughput and scalability. Extensions should consider adopting this model for their own internal operations.
ja_jp: Quarkus のリアクティブコアは、その優れたスループットとスケーラビリティーに主に貢献します。エクステンションは、独自の内部操作にこのモデルを採用することを検討する必要があります。

source: Quarkus, after you evaluate whether using a database to store transaction logs is right for you, allows the following JDBC-specific configuration of the object store included in `quarkus.transaction-manager.object-store._<property>_` properties, where _<property>_ can be:
ja_jp: Quarkusでは、トランザクションログの保存にデータベースを使用することが適切かどうかを評価したら、 `quarkus.transaction-manager.object-store. _<property>_` プロパティで次のようにオブジェクトストアのjdbc固有の設定を行うことができます。 ここで、 _<property>_ は次のとおりです:

source: Quarkus-compatible `CommandLine.IFactory` bean created by `picocli` extension.
ja_jp: `picocli` のエクステンションで作成された Quarkus 互換の `CommandLine.IFactory` Bean。

source: Quarkus-native config property
ja_jp: Quarkus ネイティブ設定プロパティー

source: QuarkusDevModeTest (Maven, Gradle and IDE)
ja_jp: QuarkusDevModeTest(Maven、Gradle、IDE)

source: QuarkusTest (Maven, Gradle and IDE)
ja_jp: QuarkusTest (Maven、Gradle、IDE)

source: QuarkusUnitTest (Maven, Gradle and IDE)
ja_jp: QuarkusUnitTest (Maven、Gradle、IDE)

source: Quarkus’s mission is to transform your entire application including the libraries it uses, into an artifact that uses significantly less resources than traditional approaches. These can then be used to build native applications using GraalVM. To do this you need to analyze and understand the full "closed world" of the application. Without the full and complete context, the best that can be achieved is partial and limited generic support. By using the Quarkus extension approach, we can bring Java applications in line with memory footprint constrained environments like Kubernetes or cloud platforms.
ja_jp: Quarkusの使命は、使用するライブラリを含むアプリケーション全体を、従来のアプローチよりも大幅に少ないリソースしか使用しないアーティファクトに変換することです。これらを使用して、GraalVMを使用してネイティブアプリケーションを構築することができます。これを行うためには、アプリケーションの完全な「クローズドワールド」を分析し、理解する必要があります。完全で完璧なコンテキストがなければ、達成可能なものは最高でも部分的で限定的、一般的なサポートです。Quarkusのエクステンションアプローチを使用することで、Kubernetesやクラウドプラットフォームのようなメモリフットプリントに制約のある環境にJavaアプリケーションを合わせることができます。

source: Quartz Configuration Reference
ja_jp: Quartz設定リファレンス

source: Queries can also be done on individual fields. For example, let's create a method to query heroes by their last name.
ja_jp: クエリは個々のフィールドに対して行うこともできます。例えば、ヒーローの名字を照会するメソッドを作ってみましょう。

source: Queries can also benefit from second-level caching. Cached query results can be returned immediately to the caller, avoiding to run the query on the database.
ja_jp: クエリもL2キャッシュの恩恵を受けることができます。キャッシュされたクエリの結果は即座に呼び出し元に返すことができるので、データベース上でクエリを実行する必要がありません。

source: Queries can be made reactive by using `Uni` as a return type, or adding `@NonBlocking` to the method:
ja_jp: クエリは、例えば `Uni` を戻り値の型として使用するか、 `@NonBlocking` をメソッドに付与することでリアクティブにすることができます。

source: Queries can be made reactive by using `Uni`, or `CompletionStage` as a return type, for example:
ja_jp: クエリは、例えば `Uni` や `CompletionStage` をリターンタイプとして使用することでリアクティブにすることができます。

source: Queries can be run on a virtual thread by adding `@RunOnVirtualThread` to the method:
ja_jp: メソッドに `@RunOnVirtualThread` を追加することで、仮想スレッド上でクエリを実行することができます：

source: Queries can of course refer to method parameters.
ja_jp: クエリはもちろんメソッドのパラメーターを参照できます。

source: Query Parameters
ja_jp: クエリーパラメーター

source: Query builds upon the proto definitions you can configure when setting up the `ProtoStreamMarshaller`. Either method of Serialization above will automatically register the schema with the server at startup, meaning that you will automatically gain the ability to query objects stored in the remote Infinispan Server.
ja_jp: クエリは、 `ProtoStreamMarshaller` の設定時に設定できるproto定義に基づいて構築されます。上記のいずれのシリアライズ方法でも、起動時に自動的にスキーマをサーバに登録し、リモートの Infinispan サーバーに保存されているオブジェクトを問い合せる機能を自動的に得られます。

source: Query debugging
ja_jp: クエリのデバッグ

source: Query methods may return collections of entities
ja_jp: クエリメソッドはエンティティのコレクションを返す場合があります

source: Query parameter
ja_jp: クエリーパラメーター

source: Query parameters
ja_jp: クエリーパラメーター

source: Query parameters are not supported. However, you can access the query using `WebSocketConnection#handshakeRequest().query()`
ja_jp: クエリーパラメーターはサポートされていません。ただし、 `WebSocketConnection#handshakeRequest().query()` を使用してクエリーにアクセスできます。

source: Query parameters to list entities
ja_jp: エンティティをリストアップするクエリパラメータ

source: Query parameters:
ja_jp: クエリーパラメーター

source: Query projection
ja_jp: クエリーの射影

source: Query projection can be done with the `project(Class)` method on the `PanacheQuery` object that is returned by the `find()` methods.
ja_jp: クエリーの射影は、 `find()` のメソッドが返す `PanacheQuery` オブジェクトに対して `project(Class)` のメソッドで行うことができます。

source: Query results traversal
ja_jp: クエリー結果のトラバーサル

source: Query string (prepended with a '?' if it exists, otherwise an empty string)
ja_jp: クエリー文字列 ( 存在する場合は '?' が前に付き、そうでない場合は空文字列 )

source: Query the GraphQL API
ja_jp: GraphQL APIへのクエリー

source: Query the endpoint to determine whether some numbers are prime numbers:
ja_jp: ある数字が素数であるかどうかをエンドポイントに問い合わせます:

source: QueryDSL support. No attempt will be made to generate implementations of any of the QueryDSL related repositories.
ja_jp: QueryDSL のサポート。QueryDSL 関連リポジトリーの実装を生成する試みは行われません。

source: QueryDSL support. No attempt will be made to generate implementations of the QueryDSL related repositories.
ja_jp: QueryDSL のサポート。QueryDSL 関連リポジトリーの実装を生成する試みは行われません。

source: Querying
ja_jp: クエリ

source: Querying capabilities
ja_jp: ケイパビリティをクエリ

source: Quick start
ja_jp: クイックスタート

source: Quick the `Quickstarts` page and click on `Facebook login > Settings` on the left menu:
ja_jp: `Quickstarts` ページをクイックし、左側のメニューの `Facebook login > Settings` をクリックします。

source: Quick-fixes updating settings
ja_jp: 設定を更新するクイックフィックス

source: Quickly Bootstrap Your Application
ja_jp: アプリケーションのクイック起動

source: Quickly picked-up by developers
ja_jp: 開発者がすぐ始められる

source: Quickstart
ja_jp: クイックスタート

source: Quickstarts URL common base prefix.
ja_jp: Quickstarts URL 共通ベースプレフィックス。

source: Quickstarts URL for `git clone` referenced by the documentation.
ja_jp: ドキュメントで参照されている `git clone` の Quickstarts URL。

source: Quickstarts URL for git clone referenced by the documentation.
ja_jp: ドキュメントから参照される git clone のクイックスタート URL です。

source: Quickstarts URL to main blob source tree; used for referencing source files.
ja_jp: メイン blob ソースツリーへのクイックスタート URL。

source: Quickstarts URL to main source archive.
ja_jp: メインソースアーカイブへのクイックスタート URL です。

source: Quickstarts URL to main source tree root; used for referencing directories.
ja_jp: メインソースツリーのルートへのクイックスタートの URL。

source: Quiltflower decompiler support
ja_jp: Quiltflowerデコンパイラのサポート

source: Quinoa - A Quarkus extension to create Modern UI with no hassle
ja_jp: Quinoa - Modern UIを手間なく作成するためのQuarkusエクステンション

source: Quinoa is taking care of hiding all the tasks around Web UI build/wiring/live-config to let you take care of your web application logic. Whether you create a full-stack Single Page Application or Microservice (micro-frontend); things are made easier for you.
ja_jp: Quinoaは、Web UIのビルド/結合/ライブ設定にまつわるすべてのタスクを隠蔽し、Webアプリケーションのロジックに専念できるようにします。フルスタックのシングルページアプリケーションやマイクロサービス（マイクロフロントエンド）を作成する場合でも、物事をより簡単にすることができます。

source: Quinoa will take care of the generated UI static files. During the Quarkus build, they will be bundled in the jar or native binary. At runtime, they will be served as efficiently as any other static resource in Quarkus. UI developers were also asking to enable Single Page App routing, it is now just a https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#spa-routing[boolean configuration].
ja_jp: 生成されたUI静的ファイルは、Quinoaで処理されます。Quarkusのビルド時に、jarまたはネイティブバイナリにバンドルされます。実行時には、Quarkusの他の静的リソースと同じように効率的に提供されます。UI開発者は、シングルページアプリのルーティングを有効にするよう求めていましたが、現在は link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#spa-routing[ブール値で設定] するだけです。

source: Quinoa... To be honest I wasn't really a fan at first, but then my wife made them in a bowl like a salad with avocado and raw salmon. Now I really enjoy it with a touch of soy sauce. Let's not digress too much, I am not here to talk about healthy food in this post, this is about an extension to enjoy coding modern UI with Quarkus.
ja_jp: Quinoa...正直最初はあまり好きではなかったのですが、妻がアボカドや生サーモンと一緒にサラダのようにボウルに入れて作ってくれたんです。今では、醤油を少し垂らして食べるのがとても美味しいです。余談ですが、この記事では健康的な食べ物について話すのではなく、QuarkusでモダンなUIをコーディングして楽しむためのエクステンションについて話しています。

source: Quite nice, right? If the application fails to process a message, it throws an exception, which either interrupts the while loop or is handled gracefully (within the `processRetrievedRecords` method). In the first case, it means that it won't commit anymore (as it happens in the `poll` method, not called anymore). If the application restarts, it resumes from the last committed offset (or apply the `auto.offset.reset` strategy, defaulting to `latest`, if there are no offsets for this group yet). It may re-process a set of messages (it's the application's responsibility to handle duplicates), but at least nothing is lost.
ja_jp: なかなかいいですよね?アプリケーションがメッセージの処理に失敗した場合、アプリケーションは例外をスローし、while ループを中断するか、( `processRetrievedRecords` メソッド内で) 優雅に処理されます。最初のケースでは、それはもうコミットしないことを意味します( `poll` メソッド内で発生するので、もう呼ばれません)。アプリケーションが再起動した場合、最後にコミットされたオフセットから再開します (または `auto.offset.reset` ストラテジーを適用し、このグループのオフセットがまだない場合は `latest` をデフォルトとして使用します)。一連のメッセージを再処理するかもしれませんが(重複を処理するのはアプリケーションの責任です)、少なくとも何も失われることはありません。

source: Quite often one only needs to create a native Linux executable for their Quarkus application (for example in order to run in a containerized environment) and would like to avoid the trouble of installing the proper GraalVM version in order to accomplish this task (for example, in CI environments it's common practice to install as little software as possible).
ja_jp: 多くの場合、Quarkusアプリケーション用のネイティブLinux実行ファイルを作成する必要があります(例えば、コンテナー化された環境で実行するためなど)、このタスクを達成するために適切なGraalVMバージョンをインストールする手間を省きたいと考えています(例えば、CI環境では、できるだけ少ないソフトウェアをインストールするのが一般的です)。

source: Qute - the Quarkus template engine
ja_jp: Qute - Quarkusのテンプレートエンジン

source: Qute - the Qute template engine exposes a reactive API to render templates in a non-blocking manner.
ja_jp: Qute - Quteテンプレートエンジンは、テンプレートをノンブロッキングでレンダリングするリアクティブAPIを公開しています。

source: Qute Configuration Reference
ja_jp: Qute 設定リファレンス

source: Qute Error Pages
ja_jp: Qute エラーページ

source: Qute Reference Guide
ja_jp: Qute リファレンスガイド

source: Qute Section Completion
ja_jp: Quteセクションの補完

source: Qute Templating Engine
ja_jp: Qute テンプレートエンジン

source: Qute Templating Engine Support - Now Available for Quarkus Tools for Visual Studio Code
ja_jp: Qute Templating Engineのサポート - Quarkus Tools for Visual Studio Codeで提供開始

source: Qute Used as a Standalone Library
ja_jp: スタンドアローンライブラリーとして使用する場合のQute

source: Qute data
ja_jp: Qute データ

source: Qute improvements
ja_jp: キュート改善

source: Qute is a templating engine designed specifically to meet the Quarkus needs. The usage of reflection is minimized to reduce the size of native images. The API combines both the imperative and the non-blocking reactive style of coding. In the development mode, all files located in `src/main/resources/templates` are watched for changes and modifications are immediately visible. Furthermore, we try to detect most of the template problems at build time. In this guide, you will learn how to easily render templates in your application.
ja_jp: Quteは、Quarkus のニーズを満たすために特別に設計されたテンプレートエンジンです。ネイティブイメージのサイズを小さくするために、リフレクションの使用は最小限に抑えられています。API は、命令型とノンブロッキングリアクティブ型の両方のスタイルのコーディングを組み合わせています。開発モードでは、 `src/main/resources/templates` にあるすべてのファイルが変更のために監視され、変更はすぐに表示されます。さらに、ビルド時にテンプレートの問題のほとんどを検出するようにしています。このガイドでは、アプリケーションでテンプレートを簡単にレンダリングする方法を学びます。

source: Qute is a templating engine designed specifically to meet the Quarkus needs. The usage of reflection is minimized to reduce the size of native images. The API combines both the imperative and the non-blocking reactive style of coding. In the development mode, all files located in the `src/main/resources/templates` folder are watched for changes and modifications are immediately visible in your application. Furthermore, Qute attempts to detect most of the template problems at build time and fail fast.
ja_jp: Qute は、Quarkus のニーズを満たすために特別に設計されたテンプレートエンジンです。ネイティブイメージのサイズを小さくするために、リフレクションの使用は最小限に抑えられています。API は、命令型とノンブロッキングリアクティブ型の両方のスタイルのコーディングを組み合わせています。開発モードでは、`src/main/resources/templates` フォルダーにあるすべてのファイルが変更があるかどうか監視され、変更はアプリケーションにすぐに表示されます。さらに、ビルド時にテンプレートの問題のほとんどの検出を試み、即座に失敗します。
